import unittest
from ashtadhyayi.lasya import लस्य_३_४_७७, लकारः
from ashtadhyayi.tinantarupam import तिङन्तरूपम्


class TestLasya(unittest.TestCase):

    def test_टित_आत्मनेपदानां_टेरे_३_४_७९(self):
        प्रत्ययाः = [
                ['ते', 'आते', 'झे'],
                ['से', 'आथे', 'ध्वे'],
                ['े', 'वहे', 'महे']
                ]
        रूपम् = ('', लकारः.लट्, False)
        फलम् = [[लस्य_३_४_७७(तिङन्तरूपम्(*रूपम्, पुरुषः, वचनम्)).तिङ्_प्रत्ययः for वचनम् in range(3)] for पुरुषः in range(3)]
        self.assertEqual(फलम्, प्रत्ययाः)

    def test_लिटस्तझयोरेशिरेच्_३_४_८१(self):
        प्रत्ययाः = [
                ['एश्', 'आते', 'इरेच्'],
                ['से', 'आथे', 'ध्वे'],
                ['े', 'वहे', 'महे']]

        रूपम् = ('', लकारः.लिट्, False)
        फलम् = [[लस्य_३_४_७७(तिङन्तरूपम्(*रूपम्, पुरुषः, वचनम्)).तिङ्_प्रत्ययः for वचनम् in range(3)] for पुरुषः in range(3)]
        self.assertEqual(फलम्, प्रत्ययाः)

    def test_परस्मैपदानां_णलतुसुस्थलथुसणल्वमाः_३_४_८२(self):
        प्रत्ययाः = [
                ['णल्', 'अतुस्', 'उस्'],
                ['थल्', 'अथुस्', 'अ'],
                ['णल्', 'व', 'म']
                ]

        रूपम् = ('', लकारः.लिट्, True)
        फलम् = [[लस्य_३_४_७७(तिङन्तरूपम्(*रूपम्, पुरुषः, वचनम्)).तिङ्_प्रत्ययः for वचनम् in range(3)] for पुरुषः in range(3)]
        self.assertEqual(फलम्, प्रत्ययाः)

    def test_विदो_लटो_वा_३_४_८३(self):
        प्रत्ययाः = [
                [['तिप्', 'णल्'], ['तस्', 'अतुस्'], ['झि', 'उस्']],
                [['सिप्', 'थल्'], ['थस्', 'अथुस्'], ['थ', 'अ']],
                [['मिप्', 'णल्'], ['वस्', 'व'], ['मस्', 'म']]
                ]

        रूपम् = ('विदँ', लकारः.लट्, True)
        फलम् = [[लस्य_३_४_७७(तिङन्तरूपम्(*रूपम्, पुरुषः, वचनम्)).तिङ्_प्रत्ययः for वचनम् in range(3)] for पुरुषः in range(3)]
        self.assertEqual(फलम्, प्रत्ययाः)

    def test_ब्रुवः_पञ्चानामादित_आहो_ब्रुवः_३_४_८४(self):
        प्रत्ययाः = [
                [['तिप्', 'णल्'], ['तस्', 'अतुस्'], ['झि', 'उस्']],
                [['सिप्', 'थल्'], ['थस्', 'अथुस्'], 'थ'],
                ['मिप्', 'वस्', 'मस्']
                ]

        रूपम् = ('ब्रूञ्', लकारः.लट्, True)
        फलम् = [[लस्य_३_४_७७(तिङन्तरूपम्(*रूपम्, पुरुषः, वचनम्)).तिङ्_प्रत्ययः for वचनम् in range(3)] for पुरुषः in range(3)]
        self.assertEqual(फलम्, प्रत्ययाः)

    def test_लोटो_लङ्वत्_३_४_८५(self):
        प्रत्ययाः = [
                ['तुप्', 'तस्', 'झु'],
                ['हि', 'थस्', 'थ'],
                ['नि', 'वस्', 'मस्']
                ]

        रूपम् = ('ब्रूञ्', लकारः.लोट्, True)
        फलम् = [[लस्य_३_४_७७(तिङन्तरूपम्(*रूपम्, पुरुषः, वचनम्)).तिङ्_प्रत्ययः for वचनम् in range(3)] for पुरुषः in range(3)]
        self.assertEqual(फलम्, प्रत्ययाः)

    # revisit this later
    # def test_लेटोऽडाटौ_३_४_९४(self):
    #     प्रत्ययाः = [
    #             ['तुप्', 'तस्', 'झु'],
    #             ['हि', 'थस्', 'थ'],
    #             ['नि', 'वस्', 'मस्']
    #             ]
    #     फलम् = [[लस्य_३_४_७७('ब्रूञ्', लकारः.लेट्, True, पुरुषः, वचनम्) for वचनम् in range(3)] for पुरुषः in range(3)]
    #     self.assertEqual(फलम्, प्रत्ययाः)


if __name__ == '__main__':
    unittest.main()
