#!/usr/bin/env python3
# -*- coding: utf-8 -*-

import unittest
from ashtadhyayi.lasya import अचोऽन्त्यादि_टि_१_१_६४, आनय_तिङ्_प्रत्ययम्, लस्य_३_४_७७, लकारः


class TestLasya(unittest.TestCase):
    def test_आनय_तिङ्_प्रत्ययम्_परस्मैपदम्(self):
        प्रत्ययाः = [
                ['तिप्', 'तस्', 'झि'],
                ['सिप्', 'थस्', 'थ'],
                ['मिप्', 'वस्', 'मस्']]

        self.assertEqual([[आनय_तिङ्_प्रत्ययम्(True, पुरुषः, वचनम्) for वचनम् in range(3)] for पुरुषः in range(3)], प्रत्ययाः)

    def test_आनय_तिङ्_प्रत्ययम्_आत्मनेपदम्(self):
        प्रत्ययाः = [
                ['त', 'आताम्', 'झ'],
                ['थास्', 'आथाम्', 'ध्वम्'],
                ['इड्', 'वहि', 'महिङ्']]

        self.assertEqual([[आनय_तिङ्_प्रत्ययम्(False, पुरुषः, वचनम्) for वचनम् in range(3)] for पुरुषः in range(3)], प्रत्ययाः)

    def test_अचोऽन्त्यादि_टि_१_१_६४(self):
        self.assertEqual(अचोऽन्त्यादि_टि_१_१_६४('आथाम्'), 'आम्')

    def test_टित_आत्मनेपदानां_टेरे_३_४_७९(self):
        प्रत्ययाः = [
                ['ते', 'आते', 'झे'],
                ['से', 'आथे', 'ध्वे'],
                ['े', 'वहे', 'महे']
                ]

        फलम् = [[लस्य_३_४_७७('', लकारः.लट्, False, पुरुषः, वचनम्) for वचनम् in range(3)] for पुरुषः in range(3)]
        self.assertEqual(फलम्, प्रत्ययाः)

    def test_लिटस्तझयोरेशिरेच्_३_४_८१(self):
        प्रत्ययाः = [
                ['एश्', 'आते', 'इरेच्'],
                ['से', 'आथे', 'ध्वे'],
                ['े', 'वहे', 'महे']]

        फलम् = [[लस्य_३_४_७७('', लकारः.लिट्, False, पुरुषः, वचनम्) for वचनम् in range(3)] for पुरुषः in range(3)]
        self.assertEqual(फलम्, प्रत्ययाः)

    def test_परस्मैपदानां_णलतुसुस्थलथुसणल्वमाः_३_४_८२(self):
        प्रत्ययाः = [
                ['णल्', 'अतुस्', 'उस्'],
                ['थल्', 'अथुस्', 'अ'],
                ['णल्', 'व', 'म']
                ]

        फलम् = [[लस्य_३_४_७७('', लकारः.लिट्, True, पुरुषः, वचनम्) for वचनम् in range(3)] for पुरुषः in range(3)]
        self.assertEqual(फलम्, प्रत्ययाः)

    def test_विदो_लटो_वा_३_४_८३(self):
        प्रत्ययाः = [
                [['तिप्', 'णल्'], ['तस्', 'अतुस्'], ['झि', 'उस्']],
                [['सिप्', 'थल्'], ['थस्', 'अथुस्'], ['थ', 'अ']],
                [['मिप्', 'णल्'], ['वस्', 'व'], ['मस्', 'म']]
                ]

        फलम् = [[लस्य_३_४_७७('विदँ', लकारः.लट्, True, पुरुषः, वचनम्) for वचनम् in range(3)] for पुरुषः in range(3)]
        self.assertEqual(फलम्, प्रत्ययाः)

    def test_ब्रुवः_पञ्चानामादित_आहो_ब्रुवः_३_४_८४(self):
        प्रत्ययाः = [
                [['तिप्', 'णल्'], ['तस्', 'अतुस्'], ['झि', 'उस्']],
                [['सिप्', 'थल्'], ['थस्', 'अथुस्'], 'थ'],
                ['मिप्', 'वस्', 'मस्']
                ]

        फलम् = [[लस्य_३_४_७७('ब्रूञ्', लकारः.लट्, True, पुरुषः, वचनम्) for वचनम् in range(3)] for पुरुषः in range(3)]
        self.assertEqual(फलम्, प्रत्ययाः)

    def test_लोटो_लङ्वत्_३_४_८५(self):
        प्रत्ययाः = [
                ['तुप्', 'तस्', 'झु'],
                ['हि', 'थस्', 'थ'],
                ['नि', 'वस्', 'मस्']
                ]
        फलम् = [[लस्य_३_४_७७('ब्रूञ्', लकारः.लोट्, True, पुरुषः, वचनम्) for वचनम् in range(3)] for पुरुषः in range(3)]
        self.assertEqual(फलम्, प्रत्ययाः)

    # revisit this later
    # def test_लेटोऽडाटौ_३_४_९४(self):
    #     प्रत्ययाः = [
    #             ['तुप्', 'तस्', 'झु'],
    #             ['हि', 'थस्', 'थ'],
    #             ['नि', 'वस्', 'मस्']
    #             ]
    #     फलम् = [[लस्य_३_४_७७('ब्रूञ्', लकारः.लेट्, True, पुरुषः, वचनम्) for वचनम् in range(3)] for पुरुषः in range(3)]
    #     self.assertEqual(फलम्, प्रत्ययाः)


if __name__ == '__main__':
    unittest.main()
