#!/usr/bin/env python3
# -*- coding: utf-8 -*-

import unittest
from ashtadhyayi.dvitva_prakaranam import एकाचो_द्वे_प्रथमस्य_६_१_१
from ashtadhyayi.tinantarupam import तिङन्तरूपम्
from ashtadhyayi.lasya import लकारः


class TestDvitvaPrakaranam(unittest.TestCase):
    def test_एकाचो_द्वे_प्रथमस्य_६_१_१_अटि(self):
        धातुः = {'धातुः': 'अटि'}
        पदम् = तिङन्तरूपम्(धातुः, लकारः.लिट्, True, 0, 0)
        एकाचो_द्वे_प्रथमस्य_६_१_१(पदम्)
        self.assertEqual(पदम्.धातुः['अभ्यासः'], 'अटि')
        self.assertEqual(पदम्.धातुः['अभ्यस्तम्'], {'प्रथमम्': 'अटि', 'द्वितीयम्': 'टि'})

    def test_एकाचो_द्वे_प्रथमस्य_६_१_१_उन्दि(self):
        धातुः = {'धातुः': 'उन्दि'}
        पदम् = तिङन्तरूपम्(धातुः, लकारः.लिट्, True, 0, 0)
        एकाचो_द्वे_प्रथमस्य_६_१_१(पदम्)
        self.assertEqual(पदम्.धातुः['अभ्यासः'], 'उन्दि')
        self.assertEqual(पदम्.धातुः['अभ्यस्तम्'], {'प्रथमम्': 'उन्दि', 'द्वितीयम्': 'दि'})

    def test_एकाचो_द्वे_प्रथमस्य_६_१_१_अद्डि(self):
        धातुः = {'धातुः': 'अद्डि'}
        पदम् = तिङन्तरूपम्(धातुः, लकारः.लिट्, True, 0, 0)
        एकाचो_द्वे_प्रथमस्य_६_१_१(पदम्)
        self.assertEqual(पदम्.धातुः['अभ्यासः'], 'अद्डि')
        self.assertEqual(पदम्.धातुः['अभ्यस्तम्'], {'प्रथमम्': 'अद्डि', 'द्वितीयम्': 'डि'})

    def test_एकाचो_द्वे_प्रथमस्य_६_१_१_अर्चि(self):
        धातुः = {'धातुः': 'अर्चि'}
        पदम् = तिङन्तरूपम्(धातुः, लकारः.लिट्, True, 0, 0)
        एकाचो_द्वे_प्रथमस्य_६_१_१(पदम्)
        self.assertEqual(पदम्.धातुः['अभ्यासः'], 'अर्चि')
        self.assertEqual(पदम्.धातुः['अभ्यस्तम्'], {'प्रथमम्': 'अर्चि', 'द्वितीयम्': 'चि'})

    def test_एकाचो_द्वे_प्रथमस्य_६_१_१_पच्(self):
        धातुः = {'धातुः': 'पच्'}
        पदम् = तिङन्तरूपम्(धातुः, लकारः.लिट्, True, 0, 0)
        एकाचो_द्वे_प्रथमस्य_६_१_१(पदम्)
        self.assertEqual(पदम्.धातुः['अभ्यासः'], 'पच्')
        self.assertEqual(पदम्.धातुः['अभ्यस्तम्'], {'प्रथमम्': 'पच्', 'द्वितीयम्': 'पच्'})

    def test_एकाचो_द्वे_प्रथमस्य_६_१_१_जागृ(self):
        धातुः = {'धातुः': 'जागृ'}
        पदम् = तिङन्तरूपम्(धातुः, लकारः.लिट्, True, 0, 0)
        एकाचो_द्वे_प्रथमस्य_६_१_१(पदम्)
        self.assertEqual(पदम्.धातुः['अभ्यस्तम्'], {'प्रथमम्': 'जागृ', 'द्वितीयम्': 'जागृ'})


if __name__ == '__main__':
    unittest.main()
