#!/usr/bin/env python3
# -*- coding: utf-8 -*-
from ashtadhyayi.it_samjna_prakarana import कित्_वा


def आर्धधातुके_२_४_३५(पदम्):
    if पदम्.विकरणप्रत्ययः['आर्धधातुकम्']:
        अदो_जग्धिर्ल्यप्ति_किति_२_४_३६(पदम्)
        वेञो_वयिः_२_४_४१(पदम्)
        हनो_वध_लिङि_२_४_४२(पदम्)
        धात्वादेश = {
            'अस्': अस्तेर्भूः_२_४_५२,
            'ब्रू': ब्रुवो_वचिः_२_४_५३,
            'चक्ष्': चक्षिङः_ख्याञ्_२_४_५४,
            'अज्': अजेर्व्यघञपोः_२_४_५६
        }
        धातुः = पदम्.धातुः['धातुः']
        if धातुः in धात्वादेश:
            पदम्.धातुः['आदेशः'] = धात्वादेश[धातुः](पदम्)


def अदो_जग्धिर्ल्यप्ति_किति_२_४_३६(पदम्):
    if पदम्.धातुः['धातुः'] == 'अद्':
        प्रत्ययः = पदम्.कृत्प्रत्ययः['प्रत्ययः']
        if प्रत्ययः == 'ल्यप्' or प्रत्ययः[0] == 'त' or कित्_वा(प्रत्ययः):
            पदम्.धातुः['आदेशः'] = 'जग्धिः'
        लुङ्सनोर्घसॢ_२_४_३७(पदम्)


def लुङ्सनोर्घसॢ_२_४_३७(पदम्):
    if पदम्.लकारः == 'लुङ्' or पदम्.विकरणप्रत्ययः['प्रत्ययः'] == 'सन्' or घञपोश्च_२_४_३८(पदम्):
        पदम्.धातुः['आदेशः'] = 'घसॢ'
    लिट्यन्यतरस्याम्(पदम्)


def घञपोश्च_२_४_३८(पदम्):
    return पदम्.विकरणप्रत्ययः['प्रत्ययः'] in ['घञ्', 'अप्']


def बहुलं_छन्दसि_२_४_३९(पदम्):
    # TODO
    return None


def लिट्यन्यतरस्याम्(पदम्):
    if पदम्.लकारः == 'लिट्':
        पदम्.धातुः['आदेशः'] = ['घसॢ', None]


def वेञो_वयिः_२_४_४१(पदम्):
    if पदम्.धातुः['धातुः'] == 'वेञ्':
        लिट्यन्यतरस्याम्(पदम्)


def हनो_वध_लिङि_२_४_४२(पदम्):
    if पदम्.धातुः['धातुः'] == 'हन्' and (पदम्.लकारः == 'लिङ्' or लुङि_च_२_४_४३(पदम्)):
        पदम्.धातुः['आदेशः'] = 'वध'
    आत्मनेपदेष्वन्यतरस्याम्_२_४_४४(पदम्)


def लुङि_च_२_४_४३(पदम्):
    return पदम्.लकारः == 'लुङ्'


def आत्मनेपदेष्वन्यतरस्याम्_२_४_४४(पदम्):
    if not पदम्.परस्मैपदम्:
        if पदम्.धातुः['धातुः'] == 'हन्' and पदम्.लकारः == 'लुङ्':
            पदम्.धातुः['आदेशः'] = ['वध', None]


def इणो_गा_लुङि_२_४_४५(पदम्):
    if पदम्.धातुः['धातुः'] == 'इण्' and पदम्.लकारः == 'लुङ्':
        पदम्.धातुः['आदेशः'] = 'गा'


def णौ_गमिरबोधने_२_४_४६(पदम्):
    if पदम्.धातुः['धातुः'] == 'इण्' and पदम्.लकारार्थः != 'बोधने':
        # TODO revisit णौ
        if पदम्.विकरणप्रत्ययः['प्रत्ययः'] == 'णि' or सनि_च_२_४_४७(पदम्):
            पदम्.धातुः['आदेशः'] = 'गम्'


def सनि_च_२_४_४७(पदम्):
    return पदम्.विकरणप्रत्ययः['प्रत्ययः'] == 'सन्'


def इङश्च_२_४_४८(पदम्):
    if पदम्.धातुः['धातुः'] == 'इङ्':
        if सनि_च_२_४_४७(पदम्):
            पदम्.धातुः['आदेशः'] = 'गम्'
        गाङ्_लिटि_२_४_४९(पदम्)


def गाङ्_लिटि_२_४_४९(पदम्):
    if पदम्.लकारः == 'लिट्':
        पदम्.धातुः['आदेशः'] = 'गाङ्‌'
    विभाषा_लुङ्लृङोः_२_४_५०(पदम्)


def विभाषा_लुङ्लृङोः_२_४_५०(पदम्):
    if पदम्.लकारः in ['लुङ्', 'लृङ्']:
        पदम्.धातुः['आदेशः'] = ['गाङ्‌', None]


def णौ_च_सँश्चङोः_२_४_५१(पदम्):
    # TODO
    return None


def अस्तेर्भूः_२_४_५२(पदम्):
    return 'भू'


def ब्रुवो_वचिः_२_४_५३(पदम्):
    return 'वच्'


def चक्षिङः_ख्याञ्_२_४_५४(पदम्):
    return 'ख्या'


def अजेर्व्यघञपोः_२_४_५६(पदम्):
    आदेशः = वा_यौ_२_४_५७(पदम्)
    if आदेशः:
        return आदेशः
    return 'वी'


def वा_यौ_२_४_५७(पदम्):
    if पदम्.कृत्प्रत्ययः['प्रत्ययः'] == 'ल्युट्':
        return ['वी', None]
