#!/usr/bin/env python3
# -*- coding: utf-8 -*-
from ashtadhyayi.pratyahara import वल्, वर्णाः
from ashtadhyayi.utils import स्वरात्_मात्रा, मात्रायाः_स्वरः
from ashtadhyayi.sajna import इको_गुणवृद्धी_१_१_३, अलोऽन्त्यात्_पूर्व_उपधा_१_१_६५
import re
from ashtadhyayi.aakadaaraat_ekaa_sajna import लघु_वा


def नेड्_वशि_कृति_७_२_८(पदम्):
    # TODO
    return None


def तितुत्रतथसिसुसरकसेषु_च_७_२_९(पदम्):
    # TODO
    return None


def आर्धधातुकस्येड्_वलादेः_७_२_३५(पदम्):
    if पदम्.धातुः.get('सेट्') and पदम्.विकरणप्रत्ययः['आर्धधातुकम्']:
        आर्धधातुक_विकरण_सेट्_प्रत्ययः = पदम्.विकरणप्रत्ययः['प्रत्ययः']
        पदम्.विकरणप्रत्ययः['इडागमः'] = आर्धधातुक_विकरण_सेट्_प्रत्ययः and वल्(आर्धधातुक_विकरण_सेट्_प्रत्ययः[0])

# सेट्धातुः = पदम्.धातुः['धातुः']
# return सेट्धातुः[:-1] + 'ि' + आर्धधातुक_विकरण_सेट्_प्रत्ययः
# else:
#     return सेट्धातुः[:-1] + आर्धधातुक_विकरण_सेट्_प्रत्ययः


def मिदेर्गुणः_७_३_८२(पदम्):
    धातुः = पदम्.धातुः['धातुः']
    if धातुः == 'मिद्' or सार्वधातुकार्धधातुकयोः_७_३_८४(पदम्) or पुगन्तलघूपधस्य_च_७_३_८६(पदम्):
        इकः_गुणः(पदम्)


# TODO move this to an appropriate place
def इकः_गुणः(पदम्):
    धातुः = पदम्.धातुः['धातुः']
    इक् = वर्णाः('इक्')
    इक् += स्वरात्_मात्रा(इक्)
    हल् = वर्णाः('हल्')
    इकः = '^(?:[{हल्}]*)([{इक्}])'.format(हल्=हल्, इक्=इक्)
    स्वरः = re.search(इकः, धातुः)
    if स्वरः:
        स्वरः = स्वरः.group(1)
        अच् = वर्णाः('अच्')

        if स्वरः not in अच्:
            गुणः = स्वरात्_मात्रा(इको_गुणवृद्धी_१_१_३(मात्रायाः_स्वरः(स्वरः)))
        else:
            गुणः = इको_गुणवृद्धी_१_१_३(स्वरः)

        पदम्.धातुः['आदेशः'] = धातुः.replace(स्वरः, गुणः)


def जुसि_च_७_३_८३(पदम्):
    # TODO
    pass


def सार्वधातुकार्धधातुकयोः_७_३_८४(पदम्):
    return पदम्.विकरणप्रत्ययः['सार्वधातुकम्'] or पदम्.विकरणप्रत्ययः['आर्धधातुकम्']


def पुगन्तलघूपधस्य_च_७_३_८६(पदम्):
    return पदम्.धातुः.get('आगमः') == 'पुक्' or लघु_वा(अलोऽन्त्यात्_पूर्व_उपधा_१_१_६५(पदम्.धातुः['धातुः']))
