#!/usr/bin/env python3
# -*- coding: utf-8 -*-
from ashtadhyayi.pratyahara import वल्


def नेड्_वशि_कृति_७_२_८(पदम्):
    # TODO
    return None


def तितुत्रतथसिसुसरकसेषु_च_७_२_९(पदम्):
    # TODO
    return None


def आर्धधातुकस्येड्_वलादेः_७_२_३५(पदम्):
    if पदम्.धातुः.get('सेट्') and पदम्.विकरणप्रत्ययः['आर्धधातुकम्']:
        सेट्धातुः = पदम्.धातुः['धातुः']
        आर्धधातुक_विकरण_सेट्_प्रत्ययः = पदम्.विकरणप्रत्ययः['प्रत्ययः']
        if वल्(आर्धधातुक_विकरण_सेट्_प्रत्ययः[0]):
            return सेट्धातुः[:-1] + 'ि' + आर्धधातुक_विकरण_सेट्_प्रत्ययः
        else:
            return सेट्धातुः[:-1] + आर्धधातुक_विकरण_सेट्_प्रत्ययः
