from ashtadhyayi.it_samjna_prakarana import णित्_वा, ञित्_वा


def गाङ्कुटादिभ्योऽञ्णिन्ङित्_१_२_१(पदम्):
    विभाषोर्णोः = विभाषोर्णोः_१_२_३(पदम्)
    if पदम्.धातुः['आदेशः'] == 'गाङ्‌' or पदम्.धातुः['गणः'] == 'कुटादिः' or विज_इट्_१_२_२(पदम्) or विभाषोर्णोः:
        प्रत्ययः = पदम्.विकरणप्रत्ययः['प्रत्ययः']
        if not णित्_वा(प्रत्ययः) and not ञित्_वा(प्रत्ययः):
            पदम्.विकरणप्रत्ययः['अतिदेशः'] == 'ङित्'
            if विभाषोर्णोः:
                पदम्.विकरणप्रत्ययः['अतिदेशः'] == ['ङित्', None]


def विज_इट्_१_२_२(पदम्):
    return पदम्.धातुः['धातुः'] == 'विज्' and पदम्.विकरणप्रत्ययः.get('इडागमः')


def विभाषोर्णोः_१_२_३(पदम्):
    return पदम्.धातुः['धातुः'] == 'ऊर्णु' and पदम्.विकरणप्रत्ययः.get('इडागमः')
