import re
from ashtadhyayi.pratyahara import वर्णाः
from ashtadhyayi.aakadaaraat_ekaa_sajna import गुरुमत्
from ashtadhyayi.it_samjna_prakarana import इत्, उपदेशसंज्ञकः
from ashtadhyayi.sajna import अलोऽन्त्यात्_पूर्व_उपधा_१_१_६५
from ashtadhyayi.utils import स्वरात्_मात्रा
from ashtadhyayi.it_samjna_prakarana import शित्_वा


def धातोरेकाचो_हलादेः_क्रियासमभिहारे_यङ्_३_१_२२(पदम्):
    कास्प्रत्ययादाममन्त्रे_लिटि_३_१_३५(पदम्)

    if पदम्.लकारः == 'लेट्':
        सिब्बहुलं_लेटि_३_१_३४(पदम्)

    स्यतासी_लृलुटोः_३_१_३३(पदम्)

    आयादयः = None
    if पदम्.धातुः == 'कमेर्':
        आयादयः = कमेर्णिङ्_३_१_३०()

    if पदम्.धातुः == 'ऋति':
        आयादयः = ऋतेरीयङ्_३_१_२९()

    if पदम्.धातुः in 'गुपू-धूप-विच्छि-पणि-पनि':
        आयादयः = गुपूधूपविच्छिपणिपनिभ्य_आयः_३_१_२८()

    if आयादयः:
        आयादय_आर्धधातुके_वा_३_१_३१(पदम्, आयादयः)


def नित्यं_कौटिल्ये_गतौ_३_१_२३():
    # TODO
    pass


def लुपसदचरजपजभदहदशगॄभ्यो_भावगर्हायाम्_३_१_२४():
    # TODO
    pass


def सत्यापपाशरूपवीणातूलश्लोकसेनालोमत्वचवर्मवर्णचूर्णचुरादिभ्यो_णिच्_३_१_२५():
    # TODO
    pass


def हेतुमति_च_३_१_२६():
    # TODO
    pass


def कण्ड्वादिभ्यो_यक्_३_१_२७():
    # TODO
    pass


def गुपूधूपविच्छिपणिपनिभ्य_आयः_३_१_२८():
    return 'आय'


def ऋतेरीयङ्_३_१_२९():
    return 'ईयङ्'


def कमेर्णिङ्_३_१_३०():
    return 'णिङ्'


def आयादय_आर्धधातुके_वा_३_१_३१(पदम्, आयादयः):
    पदम्.विकरणप्रत्ययः['प्रत्ययः'] = आयादयः
    पदम्.विकरणप्रत्ययः['आर्धधातुकम्'] = True


def सनाद्यन्ता_धातवः_३_१_३२():
    # TODO
    pass


def स्यतासी_लृलुटोः_३_१_३३(पदम्):
    if पदम्.लकारः in ['लृङ्', 'लृट्']:
        पदम्.विकरणप्रत्ययः['प्रत्ययः'] = 'स्य'
    if पदम्.लकारः == 'लुट्':
        पदम्.विकरणप्रत्ययः['प्रत्ययः'] = 'तास्'
    return


def सिब्बहुलं_लेटि_३_१_३४(पदम्):
    पदम्.विकरणप्रत्ययः = 'सिप्'


def कास्प्रत्ययादाममन्त्रे_लिटि_३_१_३५(पदम्):
    if पदम्.लकारः == 'लिट्':
        if पदम्.धातुः == 'कास्' or इजादेश्च_गुरुमतोऽनृच्छः_३_१_३६(पदम्) or दयायासश्च_३_१_३७(पदम्):
            पदम्.विकरणप्रत्ययः = 'आम्'

        if उषविदजागृभ्योऽन्यतरस्याम्_३_१_३८(पदम्) or भीह्रीभृहुवां_श्लुवच्च_३_१_३९(पदम्):
            पदम्.विकरणप्रत्ययः = [None, 'आम्']


def इजादेश्च_गुरुमतोऽनृच्छः_३_१_३६(पदम्):
    if पदम्.धातुः != 'ऋच्छ्':
        इच् = वर्णाः('इच्')
        # TODO use savarnas,
        इजादिः = '^[{इच्}ईऊॠ].'.format(इच्=इच्)
        if re.search(इजादिः, पदम्.धातुः) and गुरुमत्(पदम्.धातुः):
            return True
    return False


def दयायासश्च_३_१_३७(पदम्):
    return पदम्.धातुः in ['दय', 'अय', 'आस']


def उषविदजागृभ्योऽन्यतरस्याम्_३_१_३८(पदम्):
    return पदम्.धातुः in ['उष', 'विद', 'जगृ']


def भीह्रीभृहुवां_श्लुवच्च_३_१_३९(पदम्):
    # TODO श्लुवच्च
    return पदम्.धातुः in ['भी', 'ह्री', 'भृ', 'हु']


def कृञ्_चानुप्रयुज्यते_लिटि_३_१_४०(पदम्):
    # TODO चानुप्रयुज्यते
    return पदम्.धातुः in ['कृ', 'भू', 'अस्']


def विदाङ्कुर्वन्त्वित्यन्यतरस्याम्_३_१_४१(पदम्):
    # TODO अन्यतरस्याम्
    return पदम्.धातुः == 'विद्'


def अभ्युत्सादयांप्रजनयांचिकयांरमयामकः_पावयांक्रियाद्विदामक्रन्निति_च्छन्दसि_३_१_४२():
    # TODO
    return


def च्लि_लुङि_३_१_४३(पदम्):
    if पदम्.लकारः == 'लुङ्':
        पदम्.विकरणप्रत्ययः = 'च्लि'


def च्लेः_सिच्_३_१_४४(पदम्):
    if पदम्.विकरणप्रत्ययः == 'च्लि':
        पदम्.विकरणप्रत्ययः = 'सिच्'


def शल_इगुपधादनिटः_क्सः_३_१_४५(पदम्):
    इक् = वर्णाः('इक्')
    इक् += स्वरात्_मात्रा(इक्)
    शल् = वर्णाः('शल्')
    # TODO अनिट्
    if पदम्.प्रत्ययः == 'च्लि' and अलोऽन्त्यात्_पूर्व_उपधा_१_१_६५(पदम्.धातुः) in इक् and पदम्.धातुः[-2] in शल्:
        पदम्.विकरणप्रत्ययः['प्रत्ययः'] = 'क्स'


def श्लिष_आलिङ्गने_३_१_४६(पदम्):
    if पदम्.धातुः == 'श्लिष्' and पदम्.धातुः.अर्थः == 'आलिङ्गने':
        पदम्.विकरणप्रत्ययः['प्रत्ययः'] = 'क्स'


def न_दृशः_३_१_४७(पदम्):
    return पदम्.धातुः == 'दृश्'


def णिश्रिद्रुस्रुभ्यः_कर्तरि_चङ्_३_१_४८(पदम्):
    if पदम्.धातुः.अतिदेशः == 'णिङ्' or पदम्.धातुः in ['श्रि', 'द्रु', 'स्रु']:
        if पदम्.विकरणप्रत्ययः['प्रत्ययः'] == 'च्लि' and पदम्.प्रयोगः == 'कर्तरि':
            पदम्.विकरणप्रत्ययः['प्रत्ययः'] = 'चङ्'


def विभाषा_धेट्श्व्योः_३_१_४९(पदम्):
    if पदम्.धातुः in ['धेट्', 'श्वि']:
        पदम्.विकरणप्रत्ययः['प्रत्ययः'] = [पदम्.विकरणप्रत्ययः['प्रत्ययः'], 'चङ्']


def गुपेश्छन्दसि_३_१_५०(पदम्):
    # TODO छन्दसि
    if पदम्.धातुः == 'गुप्' and not नोनयतिध्वनयत्येलयत्यर्दयतिभ्यः_३_१_५१(पदम्):
        पदम्.विकरणप्रत्ययः['प्रत्ययः'] = [पदम्.विकरणप्रत्ययः['प्रत्ययः'], 'चङ्']


def नोनयतिध्वनयत्येलयत्यर्दयतिभ्यः_३_१_५१(पदम्):
    return पदम्.धातुः in ['ऊन', 'ध्वन', 'इल', 'अर्द']


def अस्यतिवक्तिख्यातिभ्योऽङ्_३_१_५२(पदम्):
    if पदम्.धातुः in ['असुँ', 'वच्', 'ख्या']:
        पदम्.विकरणप्रत्ययः['प्रत्ययः'] = 'अङ्'


def लिपिसिचिह्वश्च_३_१_५३(पदम्):
    if पदम्.धातुः in ['लिप्', 'सिच्', 'ह्वे']:
        if आत्मनेपदेष्वन्यतरस्याम्_३_१_५४():
            पदम्.विकरणप्रत्ययः['प्रत्ययः'] = [पदम्.विकरणप्रत्ययः['प्रत्ययः'], 'अङ्']
        else:
            पदम्.विकरणप्रत्ययः['प्रत्ययः'] = 'अङ्'


def आत्मनेपदेष्वन्यतरस्याम्_३_१_५४(पदम्):
    return not पदम्.परस्मैपदम्


def पुषादिद्युताद्यॢदितः_परस्मैपदेषु_३_१_५५(पदम्):
    if पदम्.परस्मैपदम् and (पदम्.गणः in ['पुषादि', 'द्युतादि'] or इत्(पदम्.धातुः, उपदेशसंज्ञकः.धातुः)[0] == 'ऌ'):
        पदम्.विकरणप्रत्ययः['प्रत्ययः'] = 'अङ्'


def सर्त्तिशास्त्यर्तिभ्यश्च_३_१_५६(पदम्):
    if पदम्.धातुः in ['सृ', 'शास्', 'ऋ'] and पदम्.परस्मैपदम्:
        पदम्.विकरणप्रत्ययः['प्रत्ययः'] = 'अङ्'


def इरितो_वा_३_१_५७(पदम्):
    if इत्(पदम्.धातुः, उपदेशसंज्ञकः.धातुः)[0] == 'इर्' and पदम्.परस्मैपदम्:
        पदम्.विकरणप्रत्ययः['प्रत्ययः'] = [पदम्.विकरणप्रत्ययः['प्रत्ययः'], 'अङ्']


def जॄस्तम्भुम्रुचुम्लुचुग्रुचुग्लुचुग्लुञ्चुश्विभ्यश्च_३_१_५८(पदम्):
    if पदम्.धातुः in ['जॄ', 'स्तन्भु', 'म्रुचु', 'म्लुचु', 'ग्रुच्', 'ग्लुच्', 'ग्लुञ्च्', 'टुओश्वि'] and पदम्.परस्मैपदम्:
        पदम्.विकरणप्रत्ययः['प्रत्ययः'] = [पदम्.विकरणप्रत्ययः['प्रत्ययः'], 'अङ्']


def कृमृदृरुहिभ्यश्छन्दसि_३_१_५९(पदम्):
    # TODO छन्दसि
    if पदम्.धातुः in ['कृ', 'मृ', 'दृ', 'रुहि']:
        पदम्.विकरणप्रत्ययः['प्रत्ययः'] = 'अङ्'


def चिण्_ते_पदः_३_१_६०(पदम्):
    # TODO
    return


def दीपजनबुधपूरितायिप्यायिभ्योऽन्यतरस्याम्_३_१_६१(पदम्):
    if पदम्.धातुः in ['दीप', 'जन', 'बुध', 'पूरि', 'तायि', 'प्यायि']:
        # TODO
        return


def अचः_कर्मकर्तरि_३_१_६२(पदम्):
    # TODO
    return


def दुहश्च_३_१_६३(पदम्):
    # TODO
    return


def न_रुधः_३_१_६४(पदम्):
    # TODO
    return


def तपोऽनुतापे_च_३_१_६५(पदम्):
    # TODO
    return


def चिण्_भावकर्मणोः_३_१_६६(पदम्):
    # TODO
    return


def तिङ्शित्सार्वधातुकम्_३_४_११३(तिङन्तरूपम्):
    तिङन्तरूपम्.तिङ्_प्रत्ययः['सार्वधातुकम्'] = True
    if तिङन्तरूपम्.विकरणप्रत्ययः['प्रत्ययः'] and शित्_वा(तिङन्तरूपम्.विकरणप्रत्ययः['प्रत्ययः']):
        तिङन्तरूपम्.विकरणप्रत्ययः['सार्वधातुकम्'] = True

    if तिङन्तरूपम्.कृत्प्रत्ययः['प्रत्ययः'] and शित्_वा(तिङन्तरूपम्.कृत्प्रत्ययः['प्रत्ययः']):
        तिङन्तरूपम्.कृत्प्रत्ययः['सार्वधातुकम्'] = True
    return


def आर्धधातुकं_शेषः_३_४_११४(तिङन्तरूपम्):
    if not तिङन्तरूपम्.विकरणप्रत्ययः['सार्वधातुकम्']:
        तिङन्तरूपम्.विकरणप्रत्ययः['आर्धधातुकम्'] = True

    if not तिङन्तरूपम्.कृत्प्रत्ययः['सार्वधातुकम्']:
        तिङन्तरूपम्.कृत्प्रत्ययः['आर्धधातुकम्'] = True


def लिट्_च_३_४_११५(तिङन्तरूपम्):
    if तिङन्तरूपम्.लकारः == 'लिट्':
        तिङन्तरूपम्.तिङ्_प्रत्ययः['आर्धधातुकम्'] = True
        तिङन्तरूपम्.तिङ्_प्रत्ययः['सार्वधातुकम्'] = False


def लिङाशिषि_३_४_११६(तिङन्तरूपम्):
    if तिङन्तरूपम्.लकारार्थः == 'आशीः':
        तिङन्तरूपम्.तिङ्_प्रत्ययः['आर्धधातुकम्'] = True
        तिङन्तरूपम्.तिङ्_प्रत्ययः['सार्वधातुकम्'] = False


def छन्दस्युभयथा_३_४_११७(तिङन्तरूपम्):
    तिङन्तरूपम्.तिङ्_प्रत्ययः['सार्वधातुकम्'] = True
    तिङन्तरूपम्.विकरणप्रत्ययः['सार्वधातुकम्'] = True
    तिङन्तरूपम्.कृत्प्रत्ययः['सार्वधातुकम्'] = True

    तिङन्तरूपम्.तिङ्_प्रत्ययः['आर्धधातुकम्'] = True
    तिङन्तरूपम्.विकरणप्रत्ययः['आर्धधातुकम्'] = True
    तिङन्तरूपम्.कृत्प्रत्ययः['आर्धधातुकम्'] = True


def सार्वधातुकम्_आर्धधातुकम्(तिङन्तरूपम्):
    तिङ्शित्सार्वधातुकम्_३_४_११३(तिङन्तरूपम्)
    आर्धधातुकं_शेषः_३_४_११४(तिङन्तरूपम्)
    लिट्_च_३_४_११५(तिङन्तरूपम्)
    लिङाशिषि_३_४_११६(तिङन्तरूपम्)
    छन्दस्युभयथा_३_४_११७(तिङन्तरूपम्)
