from ashtadhyayi.it_samjna_prakarana import शित्_वा


def तिङ्शित्सार्वधातुकम्_३_४_११३(तिङन्तरूपम्):
    तिङन्तरूपम्.तिङ्_प्रत्ययः['सार्वधातुकम्'] = True
    if तिङन्तरूपम्.विकरणप्रत्ययः['प्रत्ययः'] and शित्_वा(तिङन्तरूपम्.विकरणप्रत्ययः['प्रत्ययः']):
        तिङन्तरूपम्.विकरणप्रत्ययः['सार्वधातुकम्'] = True

    if तिङन्तरूपम्.कृत्प्रत्ययः['प्रत्ययः'] and शित्_वा(तिङन्तरूपम्.कृत्प्रत्ययः['प्रत्ययः']):
        तिङन्तरूपम्.कृत्प्रत्ययः['सार्वधातुकम्'] = True
    return


def आर्धधातुकं_शेषः_३_४_११४(तिङन्तरूपम्):
    if not तिङन्तरूपम्.विकरणप्रत्ययः['सार्वधातुकम्']:
        तिङन्तरूपम्.विकरणप्रत्ययः['आर्धधातुकम्'] = True

    if not तिङन्तरूपम्.कृत्प्रत्ययः['सार्वधातुकम्']:
        तिङन्तरूपम्.कृत्प्रत्ययः['आर्धधातुकम्'] = True


def लिट्_च_३_४_११५(तिङन्तरूपम्):
    if तिङन्तरूपम्.लकारः == 'लिट्':
        तिङन्तरूपम्.तिङ्_प्रत्ययः['आर्धधातुकम्'] = True
        तिङन्तरूपम्.तिङ्_प्रत्ययः['सार्वधातुकम्'] = False


def लिङाशिषि_३_४_११६(तिङन्तरूपम्):
    if तिङन्तरूपम्.लकारार्थः == 'आशीः':
        तिङन्तरूपम्.तिङ्_प्रत्ययः['आर्धधातुकम्'] = True
        तिङन्तरूपम्.तिङ्_प्रत्ययः['सार्वधातुकम्'] = False


def छन्दस्युभयथा_३_४_११७(तिङन्तरूपम्):
    तिङन्तरूपम्.तिङ्_प्रत्ययः['सार्वधातुकम्'] = True
    तिङन्तरूपम्.विकरणप्रत्ययः['सार्वधातुकम्'] = True
    तिङन्तरूपम्.कृत्प्रत्ययः['सार्वधातुकम्'] = True

    तिङन्तरूपम्.तिङ्_प्रत्ययः['आर्धधातुकम्'] = True
    तिङन्तरूपम्.विकरणप्रत्ययः['आर्धधातुकम्'] = True
    तिङन्तरूपम्.कृत्प्रत्ययः['आर्धधातुकम्'] = True


def सार्वधातुकम्_आर्धधातुकम्(तिङन्तरूपम्):
    तिङ्शित्सार्वधातुकम्_३_४_११३(तिङन्तरूपम्)
    आर्धधातुकं_शेषः_३_४_११४(तिङन्तरूपम्)
    लिट्_च_३_४_११५(तिङन्तरूपम्)
    लिङाशिषि_३_४_११६(तिङन्तरूपम्)
    छन्दस्युभयथा_३_४_११७(तिङन्तरूपम्)
