from ashtadhyayi.utils import स्वरमात्राः, स्वराः
import re
from ashtadhyayi.lasya import लकारः


def एकाचो_द्वे_प्रथमस्य_६_१_१(पदम्):
    द्वितीयम् = अजादेर्द्वितीयस्य_६_१_२(पदम्)
    if not द्वितीयम्:
        द्वितीयम् = पदम्.धातुः['धातुः']
    पूर्वोऽभ्यासः_६_१_४(पदम्, पदम्.धातुः['धातुः'])
    उभे_अभ्यस्तम्_६_१_५(पदम्, द्वितीयम्)
    जक्षित्यादयः_षट्_६_१_६(पदम्)


def अजादेर्द्वितीयस्य_६_१_२(पदम्):
    अजादिप्रतिरूपम् = '^([{स्वराः}])(.*[{स्वरमात्राः}].*)$'.format(स्वराः=स्वराः(), स्वरमात्राः=स्वरमात्राः())
    अजादिः = re.search(अजादिप्रतिरूपम्, पदम्.धातुः['धातुः'])
    if अजादिः:
        द्वितीयम् = अजादिः.group(2)
        if न_न्द्राः_संयोगादयः_६_१_३(द्वितीयम्):
            # leave first two chars, one for halanta
            return द्वितीयम्[2:]
        return द्वितीयम्


def न_न्द्राः_संयोगादयः_६_१_३(द्वितीयम्):
    return द्वितीयम्[0] in ['न', 'द', 'र']


def पूर्वोऽभ्यासः_६_१_४(पदम्, अभ्यासः):
    पदम्.धातुः['अभ्यासः'] = अभ्यासः


def उभे_अभ्यस्तम्_६_१_५(पदम्, द्वितीयम्):
    पदम्.धातुः['अभ्यस्तम्'] = {'प्रथमम्': पदम्.धातुः['अभ्यासः'], 'द्वितीयम्': द्वितीयम्}


def जक्षित्यादयः_षट्_६_१_६(पदम्):
    # TODO get antargana from dhatupaatha
    धातुः = पदम्.धातुः['धातुः']
    if धातुः in ['जक्षँ', 'जागृ', 'दरिद्रा', 'चकासृँ', 'शासुँ', 'दीधीङ्', 'वेवीङ्']:
        पदम्.धातुः['अभ्यस्तम्'] = {'प्रथमम्': धातुः, 'द्वितीयम्': धातुः}


def तुजादीनां_दीर्घोऽभ्यासस्य_६_१_७(पदम्):
    # TODO
    pass


def लिटि_धातोरनभ्यासस्य_६_१_८(पदम्):
    if पदम्.लकारः == लकारः.लिट् and not पदम्.धातुः['अभ्यस्तम्']:
        # TODO dvitvam
        pass


def सन्यङोः_६_१_९(पदम्):
    # TODO
    pass


def श्लौ_६_१_१०(पदम्):
    # TODO
    pass


def चङि_६_१_११(पदम्):
    # TODO
    pass


def दाश्वान्सा_साह्वान्मी_मीढ्वांश्च_६_१_१२(पदम्):
    # TODO
    pass
