#!/usr/bin/env python3
# -*- coding: utf-8 -*-

import sys
import re
from ashtadhyayi.pratyahara import वर्णाः
from ashtadhyayi.it_samjna_prakarana import इत्, स्वरात्_मात्रा, उपदेशसंज्ञकः


def लः_परस्मैपदम्_१_४_९९():
    return तिप्तस्झिसिप्थस्थमिब्वस्मस्_तातांझथासाथांध्वमिड्वहिमहिङ्_३_४_७८()[:9]
    
def तङानावात्मनेपदम्_१_४_१००():
	return तिप्तस्झिसिप्थस्थमिब्वस्मस्_तातांझथासाथांध्वमिड्वहिमहिङ्_३_४_७८()[9:]

def तिप्तस्झिसिप्थस्थमिब्वस्मस्_तातांझथासाथांध्वमिड्वहिमहिङ्_३_४_७८():
    return ['तिप्','तस्','झि','सिप्','थस्','थ','मिप्','वस्','मस्','त','आताम्','झ','थास्','आथाम्','ध्वम्','इड्','वहि','महिङ्']

def तिङस्त्रीणि_त्रीणि_प्रथममध्यमोत्तमाः_१_४_१०१(प्रत्ययाः, पुरुषः):
    return प्रत्ययाः[ 3 * पुरुषः : 3 * (पुरुषः+1)]

def तान्येकवचनद्विवचनबहुवचनान्येकशः_१_४_१०२(प्रत्ययाः, वचनम्):
    return प्रत्ययाः[वचनम्]

def टित्_वा(लकारः):
    return इत्(लकारः, उपदेशसंज्ञकः.आदेशः)[0] == 'ट्'

def अचोऽन्त्यादि_टि_१_१_६४(शब्दः):
    अच् = वर्णाः('अच्')
    हल् = वर्णाः('हल्')
    टि_संज्ञा = '{अच्}[{हल्}्]*$'.format(अच्=अच्, हल्=हल्)
    return re.search(टि_संज्ञा, शब्दः)

def टित_आत्मनेपदानां_टेरे_३_४_७९(तिङ्):
    if तिङ् == 'थास्':
        return थासस्से_३_४_८०()
    else:
        टि = अचोऽन्त्यादि_टि_१_१_६४(तिङ्)
        print(टि)
        if टि:
            return तिङ्.replace(टि, स्वरात्_मात्रा('ए'))
        return तिङ्
    
def थासस्से_३_४_८०():
    return 'से'

def लस्य_३_४_७७(लकारः, परस्मैपदम्, पुरुषः, वचनम्):
    तिङ्_प्रत्ययः = तान्येकवचनद्विवचनबहुवचनान्येकशः_१_४_१०२(तिङस्त्रीणि_त्रीणि_प्रथममध्यमोत्तमाः_१_४_१०१(लः_परस्मैपदम्_१_४_९९() if परस्मैपदम् else तङानावात्मनेपदम्_१_४_१००(), पुरुषः), वचनम्) 

    print(इत्(लकारः))

    if टित्_वा(लकारः) and not परस्मैपदम्:    
        तिङ्_प्रत्ययः = टित_आत्मनेपदानां_टेरे_३_४_७९(तिङ्_प्रत्ययः)

    return तिङ्_प्रत्ययः

if __name__ == '__main__':
    print(लस्य_३_४_७७(sys.argv[1], sys.argv[2] == 'परस्मैपदम्', int(sys.argv[3]), int(sys.argv[4])))
