#!/usr/bin/env python3
# -*- coding: utf-8 -*-

import sys

def लः_परस्मैपदम्_१_४_९९():
    return तिप्तस्झिसिप्थस्थमिब्वस्मस्_तातांझथासाथांध्वमिड्वहिमहिङ्_३_४_७८()[:9]
    
def तङानावात्मनेपदम्_१_४_१००():
	return तिप्तस्झिसिप्थस्थमिब्वस्मस्_तातांझथासाथांध्वमिड्वहिमहिङ्_३_४_७८()[9:]

def तिप्तस्झिसिप्थस्थमिब्वस्मस्_तातांझथासाथांध्वमिड्वहिमहिङ्_३_४_७८():
    return ['तिप्','तस्','झि','सिप्','थस्','थ','मिप्','वस्','मस्','त','आताम्','झ','थास्','आथाम्','ध्वम्','इड्','वहि','महिङ्']

def तिङस्त्रीणि_त्रीणि_प्रथममध्यमोत्तमाः_१_४_१०१(प्रत्ययाः, पुरुषः):
    return प्रत्ययाः[ 3 * पुरुषः : 3 * (पुरुषः+1)]

def तान्येकवचनद्विवचनबहुवचनान्येकशः_१_४_१०२(प्रत्ययाः, वचनम्):
    return प्रत्ययाः[वचनम्]

def लस्य_३_४_७७(लकार, परस्मैपदम्, पुरुषः, वचनम्):
    return तान्येकवचनद्विवचनबहुवचनान्येकशः_१_४_१०२(तिङस्त्रीणि_त्रीणि_प्रथममध्यमोत्तमाः_१_४_१०१(लः_परस्मैपदम्_१_४_९९() if परस्मैपदम् else तङानावात्मनेपदम्_१_४_१००(), पुरुषः), वचनम्) 

if __name__ == '__main__':
    print(लस्य_३_४_७७(sys.argv[1], sys.argv[2] == 'परस्मैपदम्', int(sys.argv[3]), int(sys.argv[4])))
