from ashtadhyayi.pratyahara import वर्णाः
from ashtadhyayi.utils import कु, स्वरात्_मात्रा, परसवर्णः, दीर्घः
from ashtadhyayi.sajna import अलोऽन्त्यात्_पूर्व_उपधा_१_१_६५
from ashtadhyayi.it_samjna_prakarana import उपदेशसंज्ञकः, इत्


def ससजुषो_रुः_८_२_६६(पदम्):
    if पदम्[-2:] == 'स्' or पदम् == 'सजुष्':
        return खरवसानयोर्विसर्जनीयः_८_३_१५(पदम्[:-2] + इत्('रुँ', उपदेशसंज्ञकः.आदेशः)['उपदेशः'], None)[0]
    return पदम्


def खरवसानयोर्विसर्जनीयः_८_३_१५(पूर्वः, परः):
    if पूर्वः[-2:] == 'र्' and (not परः or परः[-1] in वर्णाः('खर्')):
        return पूर्वः[:-2] + 'ः', परः


def नश्चापदान्तस्य_झलि_८_३_२४(पूर्वः, परः):
    if पूर्वः in ['न्', 'म्'] and परः[0] in वर्णाः('झल्'):
        परसवर्णः = अनुस्वारस्य_ययि_परसवर्णः_८_४_५८('ं', परः)
        if परसवर्णः:
            return परसवर्णः + परः
        return 'ं' + परः
    return पूर्वः + परः


def आदेशप्रत्यययोः_८_३_५९(पदम्, आदेशप्रत्ययः):
    इण् = वर्णाः('इण्', True)
    इण्कु = इण् + स्वरात्_मात्रा(इण्) + कु()

    if (पदम्[-1] in इण्कु or (पदम्[-1] == '्' and पदम्[-2] in इण्कु)) and आदेशप्रत्ययः[0] == 'स':
        return आदेशप्रत्ययः.replace('स', 'ष', 1)


def अनुस्वारस्य_ययि_परसवर्णः_८_४_५८(पूर्वः, परः):
    if पूर्वः[-1] == 'ं' and परः[0] in वर्णाः('यय्'):
        return परसवर्णः(परः[0])


def उपधायां_च_८_२_७८(पदम्):
    इक् = वर्णाः('इक्')
    इक् += स्वरात्_मात्रा(इक्)
    धातुः = पदम्.धातुः['धातुः']
    उपधा = अलोऽन्त्यात्_पूर्व_उपधा_१_१_६५(धातुः)
    if उपधा == 'र्':
        rindex = धातुः.index('र')
        while rindex > 0:
            rindex -= 1
            वर्णः = धातुः[rindex]
            if वर्णः in इक्:
                पदम्.धातुः['धातुः'] = धातुः[:rindex] + दीर्घः(वर्णः) + धातुः[rindex + 1:]
                break
