#!/usr/bin/env python3
# -*- coding: utf-8 -*-


import re
from ashtadhyayi.pratyahara import वर्णाः
from ashtadhyayi.utils import स्वरमात्राः, मात्रायाः_स्वरः


def हलोऽनन्तराः_संयोगः_१_१_७(अक्षराणि):
    हल् = वर्णाः('हल्')
    संयोगः = '([{हल्}]?[{हल्}]्)+[{हल्}]?'.format(हल्=हल्)
    return re.search(संयोगः, अक्षराणि)


def अचोऽन्त्यादि_टि_१_१_६४(शब्दः):
    टि_संज्ञा = आनय_टि_संज्ञाम्()
    हल् = वर्णाः('हल्')
    टि = re.search(टि_संज्ञा, शब्दः)
    if टि:
        टि = टि.group()
        if टि[0] in हल्:
            length = len(टि)
            if length > 1 and टि[1] not in हल्:
                return मात्रायाः_स्वरः(टि[1]) + (टि[2:] if length > 2 else '')
            else:
                return 'अ'
        return टि
    return None


def आनय_टि_संज्ञाम्():
    अल् = वर्णाः('अल्')
    हल् = वर्णाः('हल्')
    मात्राः = स्वरमात्राः()
    टि_संज्ञा = '[{अल्}][{मात्राः}]?(?!्)([{हल्}]्){{0,2}}$'.format(अल्=अल्, मात्राः=मात्राः, हल्=हल्)
    return टि_संज्ञा


def ऊकालोऽज्झ्रस्वदीर्घप्लुतः_१_२_२७():
    return {
        'ह्रस्वः': ['अ', 'इ', 'उ', 'ऋ', 'ऌ'],
        'दीर्घः': ['आ', 'ई', 'ऊ', 'ॠ', 'ए', 'ऐ', 'ओ', 'औ'],
        'प्लुतः': ['अ३', 'इ३', 'उ३', 'ऋ३', 'ऌ३', 'ए३', 'ऐ३', 'ओ३', 'औ३']
    }
