import re
from ashtadhyayi.pratyahara import वर्णाः
from ashtadhyayi.utils import स्वरमात्राः, मात्रायाः_स्वरः, अनुदात्त, स्वरित


def वृद्धिरादैच्_१_१_१():
    return ['आ', *वर्णाः('ऐच्')]


def अदेङ्_गुणः_१_१_२():
    return ['अ', *वर्णाः('एङ्')]


def इको_गुणवृद्धी_१_१_३(अक्षरम्, संज्ञा='गुणः'):
    # TODO derive
    गुणवृद्धी = {
        'गुणः': ['ए', 'ओ', 'अर्', 'अल्'],
        'वृद्धिः': ['ऐ', 'औ', 'आर्', 'आल्']
    }

    इक् = वर्णाः('इक्')
    सूची = इक्.index(अक्षरम्)
    return गुणवृद्धी.get(संज्ञा)[सूची]


def हलोऽनन्तराः_संयोगः_१_१_७(अक्षराणि):
    हल् = वर्णाः('हल्')
    संयोगः = '([{हल्}]?[{हल्}]्)+[{हल्}]?'.format(हल्=हल्)
    return re.search(संयोगः, अक्षराणि)


def मिदचोऽन्त्यात्परः_१_१_४७(इत्, आगमः, स्थानी):
    if इत् == 'म्':
        हल् = वर्णाः('हल्')
        परिणामः = re.search('^(.*?)([{हल्}]्)*$'.format(हल्=हल्), स्थानी)
        if परिणामः:
            return परिणामः.group(1), आगमः, परिणामः.group(2)


def अचोऽन्त्यादि_टि_१_१_६४(शब्दः):
    टि_संज्ञा = आनय_टि_संज्ञाम्()
    हल् = वर्णाः('हल्')
    टि = re.search(टि_संज्ञा, शब्दः)
    if टि:
        टि = टि.group()
        if टि[0] in हल्:
            length = len(टि)
            if length > 1 and टि[1] not in हल्:
                return मात्रायाः_स्वरः(टि[1]) + (टि[2:] if length > 2 else '')
            else:
                return 'अ'
        return टि
    return None


def अलोऽन्त्यात्_पूर्व_उपधा_१_१_६५(शब्दः):
    हल् = वर्णाः('हल्')
    मात्राः = स्वरमात्राः()

    if शब्दः[-1] == '्':
        उपधा = शब्दः[-3]
        if उपधा == '्':
            return शब्दः[-4:-2]
    elif शब्दः[-1] in हल्:
        return शब्दः[-1] + '्'
    else:
        उपधा = शब्दः[-2]

    if उपधा == '्':
        return शब्दः[-4:-2]
    elif उपधा in हल्:
        return 'अ'
    elif उपधा in मात्राः:
        return उपधा
    else:
        # this should not happen
        raise AssertionError()


def आनय_टि_संज्ञाम्():
    अल् = वर्णाः('अल्')
    हल् = वर्णाः('हल्')
    मात्राः = स्वरमात्राः()
    टि_संज्ञा = '[{अल्}][{मात्राः}]?(?!्)([{हल्}]्){{0,2}}$'.format(अल्=अल्, मात्राः=मात्राः, हल्=हल्)
    return टि_संज्ञा


def ऊकालोऽज्झ्रस्वदीर्घप्लुतः_१_२_२७():
    return {
        'ह्रस्वः': ['अ', 'इ', 'उ', 'ऋ', 'ऌ'],
        'दीर्घः': ['आ', 'ई', 'ऊ', 'ॠ', 'ए', 'ऐ', 'ओ', 'औ'],
        'प्लुतः': ['अ३', 'इ३', 'उ३', 'ऋ३', 'ऌ३', 'ए३', 'ऐ३', 'ओ३', 'औ३']
    }


def अनुदात्तङित_आत्मनेपदम्_१_३_१२(इत्):
    for इ in इत्:
        if अनुदात्त in इ:
            return True
    return 'ङ्' in इत्


def स्वरितञितः_कर्त्रभिप्राये_क्रियाफले_१_३_७२(इत्):
    for इ in इत्:
        if स्वरित in इ:
            return True
    return 'ञ्' in इत्


# def णिचश्च_१_३_७४(गणः):
#     if सत्यापपाशरूपवीणातूलश्लोकसेनालोमत्वचवर्मवर्णचूर्णचुरादिभ्यो_णिच्_३_१_२५(गणः):
#         return True
