from enum import Enum


लकारः = Enum('लकारः', 'लट् लिट् लुट् लृट् लेट् लोट् लङ् लिङ् लुङ् लृङ्')


class तिङन्तरूपम्:

    def __init__(self, धातुः, लकारः, परस्मैपदम्, पुरुषः, वचनम्):
        self.धातुः = धातुः
        self.लकारः = लकारः
        self.परस्मैपदम् = परस्मैपदम्
        self.पुरुषः = पुरुषः
        self.वचनम् = वचनम्
        self.तिङ्_प्रत्ययः = {'प्रत्ययः': None, 'सार्वधातुकम्': False, 'आर्धधातुकम्': False}
        self.विकरणप्रत्ययः = {'प्रत्ययः': None, 'सार्वधातुकम्': False, 'आर्धधातुकम्': False}
        self.कृत्प्रत्ययः = {'प्रत्ययः': None, 'सार्वधातुकम्': False, 'आर्धधातुकम्': False}
        self.लकारार्थः = None


def तिङन्तम्(धातुः, लकारः, परस्मैपदम्, पुरुषः, वचनम्):
    पदम् = तिङन्तरूपम्(धातुः, लकारः, परस्मैपदम्, पुरुषः, वचनम्)
    # प्रक्रिया
    इडागमविधिः(पदम्)
    धात्वादेशः(पदम्)
    अतिदेशः_अङ्गकार्यः(पदम्)
    सामान्यअङ्गकार्यः(पदम्)
    षत्वविधिः(पदम्)

    return पदम्


def इडागमविधिः(पदम्):
    return None


def धात्वादेशः(पदम्):
    return None


def अतिदेशः_अङ्गकार्यः(पदम्):
    return None


def सामान्यअङ्गकार्यः(पदम्):
    return None


def षत्वविधिः(पदम्):
    return None
