
def आदेच_उपदेशेऽशिति_६_१_४५(पदम्):
    धात्वादेः_षः_सः_६_१_६४(पदम्)

    # ' ेैोौ' = ' े'+'ेै'+'ो'+'ौ' - एजन्त
    धातुः = पदम्.धातुः['धातुः']
    if धातुः[-1] in ' ेैोौ' and पदम्.विकरणप्रत्ययः['आर्धधातुकम्']:
        return धातुः[:-1] + 'ा'
    else:
        return None


def धात्वादेः_षः_सः_६_१_६४(पदम्):
    धात्वादेः('ष', 'स', पदम्)
    णो_नः_६_१_६५(पदम्)


def धात्वादेः(स्थानी, आदेशः, पदम्):
    धातुः = पदम्.धातुः['धातुः']
    if धातुः[0] == स्थानी:
        धातुः[0] = आदेशः
        # dhatu or adesha?
        पदम्.धातुः['धातुः'] = धातुः


def णो_नः_६_१_६५(पदम्):
    धात्वादेः('ण', 'न', पदम्)
